# Introduction to Databases!

## Database VS Spreadsheets

"Excel also stores my data and I can retrieve and manipulate the data using filters, join it to other files and worksheets, perform advanced functions like VLOOKUP, PivotTable, and so on. So why do I need this fancy database thing you are talking about? You IT guys just want to milk money from me. No, my Excel sheets are perfectly adequate!"

Sound familiar? It might be if you’ve ever worked as a database consultant for small businesses. It would seem at first glance that a lot of the functionality offered by databases can be achieved much more easily (and cheaply!) by just using spreadsheets. However, the spreadsheet has a number of limitations that make it unsuitable for managing some data situations:

Spreadsheets generally cannot handle multi-user access. If you work in an organization that uses shared files, you have more likely than not come across the annoying "file is locked by another user" error message. Even if a specific type of spreadsheet has some multi-user functionality, it is relatively limited. Databases on the other hand, can perfectly handle multi-user access, even for a mix of read-writes and read-only access for the same data item.
Spreadsheets provide poor data validation and integrity. There’s little stopping one of your users from totally deleting the data in an Excel file. Sure you can employ worksheet passwords, but these provide a very limited level of security, and cannot stop someone from deleting the entire file. Databases can provide a fine-grained level of security and can even protect users from their own human mistakes. For instance, a database application can easily be set up to ensure that when creating a customer you must also enter a Social Security number.

Querying and reporting is one feature that spreadsheets do not do well. The ability to run queries against a data set is extremely useful. Granted, spreadsheets can offer some rudimentary reporting via filters and graphing, but comparing this to SQL queries in databases that can join multiple tables and perform complex operations is akin to comparing Fred Flinststone’s car to a brand-new Mercedes S-Class, the epitome of motoring technology.
Computer resources are severely tasked by handling large spreadsheets. Databases can easily hold and provide access to data in the order of millions of rows, organized into hundreds of tables, all running on a basic server, without breaking a sweat. Try increasing the number of rows in your Excel file to hundreds of thousands of rows, and watch what happens to your computer’s response time.

Spreadsheets are much easier to create and maintain. Databases require more investment in terms of both of financial outlay and human training. However, the reward for this is a much more robust and secure storage and retrieval data system. The point at which you need to move away from spreadsheets and into a database-based system may be when you answer "yes" to one or more of the following questions:

Is the data held in spreadsheets needed over a long-term or recurring basis, as opposed to a one-time work in progress?
Do multiple people need access to this data?
Do you need to safeguard against erroneous entries?
Does the data need to be protected against inadvertent corruption?
Need more convincing? Well an authority no less than the U.S. government has decreed, via Section 404 of the Sarbanes-Oxley Act, that all public companies must move the reporting of key financial data away from spreadsheets.

# Data Collection

We have scraped our data from IMDB and used Twitter and Facebook for scraping the social media. You can find good tutorials on using these on the following links:
- [IMDB scraping](https://www.dataquest.io/blog/web-scraping-beautifulsoup/)
- [Using Facebook API](https://towardsdatascience.com/how-to-use-facebook-graph-api-and-extract-data-using-python-1839e19d6999)
- [Using twitter API](http://stackabuse.com/accessing-the-twitter-api-with-python/)

These topics are very important for data collection, but they are out of scope of this blog. Here we are mainly focused on creating a database.

#### Enough talks, lets get on to it!

In [2]:
#Calling Dependencies
import pandas as pd
import numpy as np
import sqlite3

# Let's have a look at our data:

We have scraped and collected the data as per the methods mentioned in the blogs above. Now let's get started by using the data to create the database. We have the scraped the data already in 1st normal form.

In [3]:
#reading the movie dataset
movie_data = pd.read_csv("imdb_movie_dataset.csv")
movie_data.head()

,certificate_id,certificate,director_id,director_name,genre_id,genre,gross_value,imdb_ratings,metscores,movie_description,Movie_id,movie_names,runtime,star_cast_id,star_cast,votes,year_release
0,2,PG-13,1350,Ryan Coogler,100,Action,291954422.0,7.9,88,"[""T'Challa, the King of Wakanda, rises to the ...",100.0,Black Panther,134,10676,Ryan Coogler,121117,2018
1,2,PG-13,1350,Ryan Coogler,104,Adventure,291954422.0,7.9,88,"[""T'Challa, the King of Wakanda, rises to the ...",100.0,Black Panther,134,10676,Ryan Coogler,121117,2018
2,2,PG-13,1350,Ryan Coogler,102,Sci,291954422.0,7.9,88,"[""T'Challa, the King of Wakanda, rises to the ...",100.0,Black Panther,134,10676,Ryan Coogler,121117,2018
3,2,PG-13,1350,Ryan Coogler,103,Fi,291954422.0,7.9,88,"[""T'Challa, the King of Wakanda, rises to the ...",100.0,Black Panther,134,10676,Ryan Coogler,121117,2018
4,2,PG-13,1350,Ryan Coogler,100,Action,291954422.0,7.9,88,"[""T'Challa, the King of Wakanda, rises to the ...",100.0,Black Panther,134,10677,Chadwick Boseman,121117,2018

In [4]:
#reading post dataset
post_data = pd.read_csv("post_data_fb.csv")
post_data = post_data.drop(['Unnamed: 0'], axis = 1)
post_data.head()

,created_at,post_comment_count,post_id,post_likes_count,post_message,post_movie,movie_id,post_shares_count,user_engagement,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,2018-03-12T20:00:00+0000,2,458711740828112_1857840717581867,6,NaN,Black Panther,100.0,4.0,12,NaN,NaN,NaN,NaN,NaN
1,2018-03-12T19:45:00+0000,0,458711740828112_1858124704220135,7,NaN,Black Panther,100.0,4.0,11,NaN,NaN,NaN,NaN,NaN
2,2018-03-12T19:30:00+0000,0,458711740828112_1857840970915175,17,NaN,Black Panther,100.0,5.0,22,NaN,NaN,NaN,NaN,NaN
3,2018-03-12T19:16:01+0000,1,458711740828112_1857951664237439,22,NaN,Black Panther,100.0,12.0,35,NaN,NaN,NaN,NaN,NaN
4,2018-03-12T19:00:00+0000,1,458711740828112_1858196714212934,31,NaN,Black Panther,100.0,12.0,44,NaN,NaN,NaN,NaN,NaN

In [5]:
#reading comment dataset
comment_data = pd.read_csv("comments_posts_fb.csv")
comment_data = comment_data.drop(['Unnamed: 0'], axis = 1)
comment_data.head()

,comments_id,created_at,post_comments,post_id
0,1857840717581867_1858341727531766,2018-03-12T20:06:32+0000,NaN,458711740828112_1857840717581867
1,1857840717581867_1858346307531308,2018-03-12T20:11:39+0000,"Vero grazie, buonanotte",458711740828112_1857840717581867
2,1857951664237439_1858307817535157,2018-03-12T19:21:25+0000,Mia,458711740828112_1857951664237439
3,1858196714212934_1858339450865327,2018-03-12T20:03:33+0000,Verissimo .,458711740828112_1858196714212934
4,1857841970915075_1858309760868296,2018-03-12T19:23:36+0000,"Soffro ma tenace,,",458711740828112_1857841970915075

In [6]:
#reading tweets database
tweets_data = pd.read_csv("Tweets.csv")
tweets_data.head()

,movie,movie_id,user_id,screen_name,tweet_id,tweet_text,hashtags,user_mentions,created_date,retweet_count
0,100.0,BlackPanther,121211,happyhealthyacw,1111,Just saw #BlackPanther and now I keep randomly...,BlackPanther,NaN,Sat Mar 17 20:41:14 +0000 2018,0
1,100.0,BlackPanther,121212,ClintonS_anchez,1112,RT @WakaFlocka: We Got Him OUT!!! #DanielKaluu...,DanielKaluuya London BlackPanther,WakaFlocka DJWhooKid,Sat Mar 17 20:41:13 +0000 2018,96
2,100.0,BlackPanther,121213,blackaqualad,1113,RT @GeeksOfColor: The Dora Milaje Take Center ...,BlackPanther,GeeksOfColor,Sat Mar 17 20:41:00 +0000 2018,281
3,100.0,BlackPanther,121214,84Samson,1114,RT @RahelWeldeab: Real talk! \r\n‘Black Panthe...,BlackPanther,RahelWeldeab,Sat Mar 17 20:40:58 +0000 2018,2
4,100.0,BlackPanther,121215,RootabagaS,1115,KillMonger and Shuri were the best character o...,BlackPanther,NaN,Sat Mar 17 20:40:58 +0000 2018,0

In [7]:
#reading the scores
tag_scores = pd.read_csv("scores.csv")
tag_scores = tag_scores[['movie_id', 'word', 'score']]
tag_scores.head()

   movie_id             word     score
0       134              NaN  2.456736
1       131              NaN  2.456736
2       102  mazerunnermovie  0.301284
3       102      dylanobrien  0.301284
4       102   sangsterthomas  0.301284

# Normalizing the data:

We see that we have our data alrady in the 1st normal form, we will have to convert the data in atleast the 3rd normal form before you store the same in a database. We will be using SQLite database for the purpose of creation of our database. The schema of the database will be explained later in the blog.

##### This is a good resource for learning to use [SQLite using python](https://www.pythoncentral.io/introduction-to-sqlite-in-python/).

In [8]:
#main table - All the other tables will be connected to this one
movie_master_table = pd.DataFrame()
movie_master_table[['movie_id','movie_names','movie_description','imdb_ratings','metascores','runtime','gross_value','year_release']] = movie_data[['Movie_id','movie_names','movie_description','imdb_ratings','metscores','runtime','gross_value','year_release']]
movie_master_table = movie_master_table.drop_duplicates()
movie_master_table.head(3)

,movie_id,movie_names,movie_description,imdb_ratings,metascores,runtime,gross_value,year_release
0,100.0,Black Panther,"[""T'Challa, the King of Wakanda, rises to the ...",7.9,88,134,291954422.0,2018
16,101.0,The Cloverfield Paradox,"['Orbiting a planet on the brink of war, scien...",5.7,37,102,NaN,2018
32,102.0,Maze Runner: The Death Cure,['Young hero Thomas embarks on a mission to fi...,6.8,51,141,55366604.0,2018

In [9]:
#starcast main table - this will connect to movie table using a seperate relational table
starcast_master_table = pd.DataFrame()
starcast_master_table[['starcast_id','starcast_name']] = movie_data[['star_cast_id','star_cast']]
starcast_master_table = starcast_master_table.drop_duplicates()
starcast_master_table.head(3)

   starcast_id      starcast_name
0        10676       Ryan Coogler
4        10677   Chadwick Boseman
8        10678  Michael B. Jordan

In [10]:
#director main table - this will connect to movie table using a seperate relational table
director_master_table = pd.DataFrame()
director_master_table[['director_id','director_name']] = movie_data[['director_id','director_name']]
director_master_table = director_master_table.drop_duplicates()
director_master_table.head(3)

    director_id director_name
0          1350  Ryan Coogler
16         1351   Julius Onah
32         1352      Wes Ball

In [11]:
#genre main table - this will connect to movie table using a seperate relational table
genre_master_table = pd.DataFrame()
genre_master_table[['genre_id','genre']] = movie_data[['genre_id','genre']]
genre_master_table = genre_master_table.drop_duplicates()
genre_master_table.head(3)

   genre_id      genre
0       100     Action
1       104  Adventure
2       102        Sci

In [12]:
#posts main table - this will connect to movie table using a seperate relational table (these are posts from facebook)
posts_master_table = pd.DataFrame()
posts_master_table[['post_id','created_at','post_message','likes_count','share_count','comments_count','user_engagement']] = post_data[['post_id','created_at','post_message','post_likes_count','post_shares_count','post_comment_count','user_engagement']]
posts_master_table = posts_master_table.drop_duplicates()
posts_master_table['created_at'] = posts_master_table['created_at'].astype('datetime64[ns]')
posts_master_table.head(3)

,post_id,created_at,post_message,likes_count,share_count,comments_count,user_engagement
0,458711740828112_1857840717581867,2018-03-12 20:00:00,NaN,6,4.0,2,12
1,458711740828112_1858124704220135,2018-03-12 19:45:00,NaN,7,4.0,0,11
2,458711740828112_1857840970915175,2018-03-12 19:30:00,NaN,17,5.0,0,22

In [13]:
#comments main table - this will connect to posts table using a seperate relational table
comments_master_table = pd.DataFrame()
comments_master_table[['comments_id','created_at','comments']] = comment_data[['comments_id','created_at','post_comments']]
comments_master_table = comments_master_table.drop_duplicates()
comments_master_table['created_at'] = comments_master_table['created_at'].astype('datetime64[ns]')
comments_master_table.head(3)

,comments_id,created_at,comments
0,1857840717581867_1858341727531766,2018-03-12 20:06:32,NaN
1,1857840717581867_1858346307531308,2018-03-12 20:11:39,"Vero grazie, buonanotte"
2,1857951664237439_1858307817535157,2018-03-12 19:21:25,Mia

In [14]:
#tweets main table - this will connect the tweets to the movies
tweets_master_table = pd.DataFrame()
tweets_master_table[['tweet_id','tweet_text', 'created_date', 'retweet_count']] = tweets_data[['tweet_id','tweet_text','created_date','retweet_count']]
tweets_master_table = tweets_master_table.drop_duplicates()
tweets_master_table.head(3)

,tweet_id,tweet_text,created_date,retweet_count
0,1111,Just saw #BlackPanther and now I keep randomly...,Sat Mar 17 20:41:14 +0000 2018,0
1,1112,RT @WakaFlocka: We Got Him OUT!!! #DanielKaluu...,Sat Mar 17 20:41:13 +0000 2018,96
2,1113,RT @GeeksOfColor: The Dora Milaje Take Center ...,Sat Mar 17 20:41:00 +0000 2018,281

In [15]:
#twitter user table - this links the user with tweets
twitter_user_table = pd.DataFrame()
twitter_user_table[['user_id','user_name']] = tweets_data[['user_id','screen_name']]
twitter_user_table = twitter_user_table.drop_duplicates()
twitter_user_table.head(3)

   user_id        user_name
0   121211  happyhealthyacw
1   121212  ClintonS_anchez
2   121213     blackaqualad

The above tables have been converted to 3rd normal form, as they follow the following rules:
- Rule 1- Be in 2NF
- Rule 2- Has no transitive functional dependencies

To better understant the normalization of your table, please visit the resource [here](https://www.studytonight.com/dbms/database-normalization.php)

# Creating Database Schema:

After we have normalized the data, we need to create the relationships based on the [ER-Diagram](https://www.lucidchart.com/pages/er-diagrams). 

Our database schema looks like this:
<img src = "C:\Users\amar\Desktop\NorthEastern University\Books\Database Management\Nick\Portfolio_SQL\DatabaseSchema.png">

Every tables has to have a primary key, and you connect two tables using the relationship tables. The relationship tables have the primary keys of the two tables they connect as the primary key. 

Now that we have a good idea of the concepts, let's start creating this relational tables.

# Design Choices:

Based on our application, we have chose to move ahead with the schema as shown in the above image.

- We decided to split our data into atomic tables to ensure full normalization of our data. 
- We use a relational table for joining each table to the other.
- We ensure perfect relationship for the joins to work well on our dataset.
- We set primary keys for all the table.
- We used foreign keys for all the values in a mapping tables, as there will be duplication.
- We used integers for values we want to perform arethamatic operations on.
- We assigned Varchar for fields which would be changed frequently.
- We applied a fixed charecter length for fields like the name, which would not be frequently updated.

In [16]:
#movie-director mapping
movie_director_maping = pd.DataFrame()
movie_director_maping[['movie_id','director_id']] = movie_data[['Movie_id','director_id']]
movie_director_maping = movie_director_maping.drop_duplicates()
movie_director_maping.head(3)

    movie_id  director_id
0      100.0         1350
16     101.0         1351
32     102.0         1352

In [17]:
#movie-starcast mapping
movie_starcast_maping = pd.DataFrame()
movie_starcast_maping[['movie_id','starcast_id']] = movie_data[['Movie_id','star_cast_id']]
movie_starcast_maping = movie_starcast_maping.drop_duplicates()
movie_starcast_maping.head(3)

   movie_id  starcast_id
0     100.0        10676
4     100.0        10677
8     100.0        10678

In [18]:
#movie-genre mapping
movie_genre_maping = pd.DataFrame()
movie_genre_maping[['movie_id','genre_id']] = movie_data[['Movie_id','genre_id']]
movie_genre_maping = movie_genre_maping.drop_duplicates()
movie_genre_maping.head(3)

   movie_id  genre_id
0     100.0       100
1     100.0       104
2     100.0       102

In [19]:
#movie-post mapping
movie_post_maping = pd.DataFrame()
movie_post_maping[['movie_id','post_id']] = post_data[['movie_id','post_id']]
movie_post_maping = movie_post_maping.drop_duplicates()
movie_post_maping.head(3)

   movie_id                           post_id
0     100.0  458711740828112_1857840717581867
1     100.0  458711740828112_1858124704220135
2     100.0  458711740828112_1857840970915175

In [20]:
#post-comment mapping
post_comment_maping = pd.DataFrame()
post_comment_maping[['post_id','comments_id']] = comment_data[['post_id','comments_id']]
post_comment_maping = post_comment_maping.drop_duplicates()
post_comment_maping.head(3)

                            post_id                        comments_id
0  458711740828112_1857840717581867  1857840717581867_1858341727531766
1  458711740828112_1857840717581867  1857840717581867_1858346307531308
2  458711740828112_1857951664237439  1857951664237439_1858307817535157

In [21]:
#movie-tweets mapping
movie_tweets_mapping = pd.DataFrame()
movie_tweets_mapping[['movie_id','tweet_id']] = tweets_data[['movie_id','tweet_id']]
movie_tweets_mapping = movie_tweets_mapping.drop_duplicates()
movie_tweets_mapping.head(3)

       movie_id  tweet_id
0  BlackPanther      1111
1  BlackPanther      1112
2  BlackPanther      1113

In [22]:
#tweets-user mapping
tweets_user_mapping = pd.DataFrame()
tweets_user_mapping[['tweet_id', 'user_id']] = tweets_data[['tweet_id','user_id']]
tweets_user_mapping = tweets_user_mapping.drop_duplicates()
tweets_user_mapping.head(3)

   tweet_id  user_id
0      1111   121211
1      1112   121212
2      1113   121213

# Creating databases:

We use an SQLite client to query databases using python. We further create the tables and the relationships within the database.

In [24]:
#creating connections
conn = sqlite3.connect("imdb_movie.db") #creates and connects to a database named "imdb_movie"
c = conn.cursor()

In [26]:
#c.execute("""DROP TABLE movie_master_table""")
c.execute("""CREATE TABLE movie_master_table(
movie_id INTEGER PRIMARY KEY,
movie_names CHAR(50),
movie_description VARCHAR(200),
imdb_ratings FLOAT,
metascores INTEGER,
runtime INTEGER,
gross_value INTEGER,
year_release CHAR(4));""") #creating a new tables within database

In [27]:
movie_master_table.to_sql("movie_master_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [28]:
#c.execute("""DROP TABLE starcast_master_table;""")
c.execute("""CREATE TABLE starcast_master_table(
starcast_id INTEGER PRIMARY KEY,
starcast_name CHAR NOT NULL);""") #creating a new tables within database

In [29]:
starcast_master_table.to_sql("starcast_master_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [30]:
#c.execute("""DROP TABLE director_master_table;""")
c.execute("""CREATE TABLE director_master_table(
director_id INTEGER PRIMARY KEY,
director_name CHAR NOT NULL);""") #creating a new tables within database

In [31]:
director_master_table.to_sql("director_master_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [32]:
#c.execute("""DROP TABLE genre_master_table;""")
c.execute("""CREATE TABLE genre_master_table(
genre_id INTEGER PRIMARY KEY,
genre CHAR NOT NULL);""") #creating a new tables within database

In [33]:
genre_master_table.to_sql("genre_master_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [34]:
#c.execute("""DROP TABLE posts_master_table;""")
c.execute("""CREATE TABLE posts_master_table(
post_id CHAR PRIMARY KEY,
created_at DATE,
post_message CHAR,
likes_count INTEGER,
share_count INTEGER,
comments_count INTEGER,
user_engagement INTEGER) ;""") #creating a new tables within database

In [35]:
posts_master_table.to_sql("posts_master_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [36]:
#c.execute("""DROP TABLE comments_master_table;""")
c.execute("""CREATE TABLE comments_master_table(
comments_id CHAR PRIMARY KEY,
created_at DATE,
comments CHAR);""") #creating a new tables within database

In [37]:
comments_master_table.to_sql("comments_master_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [38]:
#c.execute("""DROP TABLE tweets_master_table;""")
c.execute("""CREATE TABLE tweets_master_table(
tweet_id INTEGER PRIMARY KEY,
tweet_text CHAR,
created_date DATE,
retweet_count INTEGER);""") #creating a new tables within database

In [39]:
tweets_master_table.to_sql("tweets_master_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [40]:
#c.execute("""DROP TABLE twitter_user_table;""")
c.execute("""CREATE TABLE twitter_user_table(
user_id INTEGER PRIMARY KEY,
user_name CHAR);""") #creating a new tables within database

In [41]:
twitter_user_table.to_sql("twitter_user_table", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [42]:
#c.execute("""DROP TABLE movie_tags;""")
c.execute("""CREATE TABLE movie_tags(
movie_id INTEGER FOREIOGN KEY,
word CHAR,
score FLOAT);""") #creating a new table within database

In [43]:
tag_scores.to_sql("movie_tags", conn, if_exists = "append", index = False) #storing dataframe to SQL database

## Creating connection to the database

Here, we are using SQLite database management system in order to create store and analyse our data. we create a relational database schema and store our data inside.

In [44]:
#c.execute("""DROP TABLE movie_director_maping;""")
c.execute("""CREATE TABLE movie_director_maping(
movie_id INTEGER FOREGION KEY,
director_id INTEGER FOREGION KEY)""") #creating a new tables within database

In [45]:
movie_director_maping.to_sql("movie_director_maping", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [46]:
#c.execute("""DROP TABLE movie_starcast_maping;""")
c.execute("""CREATE TABLE movie_starcast_maping(
movie_id INTEGER FOREGION KEY,
starcast_id INTEGER FOREGION KEY)""") #creating a new tables within database

In [47]:
movie_starcast_maping.to_sql("movie_starcast_maping", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [48]:
#c.execute("""DROP TABLE movie_genre_maping;""")
c.execute("""CREATE TABLE movie_genre_maping(
movie_id INTEGER FOREGION KEY,
genre_id INTEGER FOREGION KEY)""") #creating a new tables within database

In [49]:
movie_genre_maping.to_sql("movie_genre_maping", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [50]:
#c.execute("""DROP TABLE movie_post_maping;""")
c.execute("""CREATE TABLE movie_post_maping(
movie_id INTEGER FOREGION KEY,
post_id CHAR FOREGION KEY)""") #creating a new tables within database

In [51]:
movie_post_maping.to_sql("movie_post_maping", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [52]:
#c.execute("""DROP TABLE post_comment_maping;""")
c.execute("""CREATE TABLE post_comment_maping(
post_id CHAR FOREGION KEY,
comments_id CHAR FOREGION KEY)""") #creating a new tables within database

In [53]:
post_comment_maping.to_sql("post_comment_maping", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [54]:
#c.execute("""DROP TABLE movie_tweets_mapping;""")
c.execute("""CREATE TABLE movie_tweets_mapping(
movie_id CHAR FOREGION KEY,
tweet_id CHAR FOREGION KEY)""") #creating a new tables within database

In [55]:
movie_tweets_mapping.to_sql("movie_tweets_mapping", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

In [56]:
#c.execute("""DROP TABLE tweets_user_mapping;""")
c.execute("""CREATE TABLE tweets_user_mapping(
tweet_id CHAR FOREGION KEY,
user_id CHAR FOREGION KEY)""") #creating a new tables within database

In [57]:
tweets_user_mapping.to_sql("tweets_user_mapping", conn, if_exists = 'append', index = False) #Storing data frame to SQL database

# Success!

We have successfully created our movie database and stored our data into them. This ends this blog at this point, please refer to the other blog for learning to create the same database in a non relational database.

# Licensing

## [MIT License](https://opensource.org/licenses/MIT)
### Copyright <2018> <COPYRIGHT Amar Chheda | Shruti Subbaiah>

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

# Licensing

## [MIT License](https://opensource.org/licenses/MIT)
### Copyright <2018> <COPYRIGHT Amar Chheda | Shruti Subbaiah>

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.